/*
 * @(#)GameConfig.java		       Project:lianmeng
 * Date:2014-3-25
 *
 * Copyright (c) 2014 CFuture09, Institute of Software, 
 * Guangdong Ocean University, Zhanjiang, GuangDong, China.
 * All rights reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
package pw.msdx.lianmengassistant.configs;

/**
 * @author Geek_Soledad <a target="_blank" href=
 *         "http://mail.qq.com/cgi-bin/qm_share?t=qm_mailme&email=XTAuOSVzPDM5LzI0OR0sLHM_MjA"
 *         style="text-decoration:none;"><img src=
 *         "http://rescdn.qqmail.com/zh_CN/htmledition/images/function/qm_open/ico_mailme_01.png"
 *         /></a>
 */
public interface HUAWEI_3C_V2 {
    /**
     * 屏幕宽，视手机而修改
     */
    int SCREEN_WIDTH = 720;
    /**
     * 屏幕高，视手机而修改
     */
    int SCREEN_HEIGHT = 1280;

    /**
     * 左边距，视手机而修改
     */
    int PADDING_LEFT = 65;
    /**
     * 右边距，视手机而修改
     */
    int PADDING_RIGHT = 65;
    /**
     * 上边距，视手机而修改
     */
    int PADDING_TOP = 246;
    /**
     * 下边距，视手机而修改
     */
    int PADDING_BOTTOM = 246;
    /**
     * 游戏方块列数（竖屏情况下，因为截的图是竖屏）
     */
    int BOX_COL = 7;
    /**
     * 游戏方块行数（竖屏情况下，因为截的图是竖屏）
     */
    int BOX_ROW = 7;
    /**
     * 数组行数。会比方块多两行是因为在进行连连看路径搜索时，需要增加顶部及底部一行。
     */
    int CODE_ROW = BOX_ROW + 2;
    /**
     * 数组列数。会比方块多两列，原因如上。
     */
    int CODE_COL = BOX_COL + 2;
    /**
     * 图片宽
     */
    float IMAGE_WIDTH = (SCREEN_WIDTH - PADDING_LEFT - PADDING_RIGHT) * 1.0f / BOX_COL;
    /**
     * 图片高
     */
    float IMAGE_HEIGHT = (SCREEN_HEIGHT - PADDING_TOP - PADDING_BOTTOM) * 1.0f / BOX_ROW;
    /**
     * 截除的边角左边距
     */
    public static final int CORNER_LEFT = 8;
    /**
     * 截除的边角上边距
     */
    public static final int CORNER_TOP = 10;
    /**
     * 截除的边角右边距
     */
    public static final int CORNER_RIGHT = 15;
    /**
     * 截除的边角下边距
     */
    public static final int CORNER_BOTTOM = 48;
    /**
     * 表示游戏方块的数据。 注：华为截图之后的图像成色有变。这里以截到的图片来说明。
     */
    public static final String[] GAME_IMAGE = {
            "0010101100100010110110000111011010010001110101001"/* 大白菜 */,
            "0100000110011011001110100011100110001000110011100"/* 梨 */,
            "0000110010100011000000101110000011001010001100000"/* 茄子(桃子) */,
            "1010101000011100100010101101001110000010000010111"/* 葡萄 */,
            "1010100110001110101000101010100100001000101001011"/* 椰子 */,
            "1000111110101001111001101011011100000011101100001"/* 香蕉 */,
            "1101010010100100110110001111101100001110000011100"/* 草莓 */,
            "0000111000111001110000000110011001000001100111000"/* 龙眼 */,
            "1000011100100001001110011100100000100011101010000"/* 菠萝 */,
            "1010000100011000011111001100110000000011001100000"/* 蓝色的（苹果？） */,

            "1010010110100001010101001111111100011001010011110"/* 月亮 */,
            "0100011110101101011100010010000111010010011110010"/* 雪花 */,
            "0010110110000101100110011110010011000100110011101"/* 雪人 */,
            "1000001000010001010111010110001110011000110011100"/* 闪电 */,
            "0000110010001110001100110011110001010101010100010"/* 龙卷风 */,
            "0010010110001000000100001110001011000000111010000"/* 太阳 */,
            "0100010110011001001101011001010111010011000101100"/* 云彩 */,
            "0110100001000110010000001100000101100100110100101"/* 温度计 */,
            "1001000010001101110110010110010000000000100000111"/* 铅笔 */,
            "0000111010010010000101010101011110010010100011010"/* 雨伞 */,

            "0011010010010111110110111100100111100111000000011"/* 奶油蛋糕 */,
            "1000100000000100010100010100011000100110110110001"/* 冰淇淋 */,
            "0010100100110101100011101101100011000010011101100"/* 蛋糕（三角） */,
            "0010011010110000111100100100010101001101010101011"/* 冰棍 */,
            "1101010100011010000011001100001101001011000100001"/* 卷心蛋糕 */,
            "0100010001010101000000001001011010010010010110001"/* 咖啡 */,
            "1100001001001100101111111001110010001110111101000"/* 柠檬饮料（三角杯子） */,
            "1100100100010100001101011100001001010011000111000"/* 面包 */,
            "1110010110000000101010001011000001110001111100111"/* 牛奶 */,
            "1101100001010001101001101010101010001001101010101"/* 煎蛋 */,

            "0010010110010100110100100011001011001100000000011"/* 黄色 */,
            "0101010110101001011001011010010101001010101001010"/* 小狗 */,
            "0010011100001100100010110001101101010000110000001"/* 小熊 */,
            "1100101100001101011000011000100001101010110101000"/* 蓝色的动物 */,
            "0110000111110101100001000011011010001011001010010"/* 野猪 */,
            "1001100111010000001101000010101101010010100110100"/* 小猪 */,
            "0101001100000001001011011101010010010010111100010"/* 兔子 */,
            "0010001011000000100010010010001000100000110000001"/* 狐狸 */,
            "0111000100010110000110010101100011110110100011100"/* 猴子 */,
            "0100011011000100000110100011000110110010101001000"/* 熊猫 */,
            "0100000100110100100001001101000000000110000000000"/* 猫 */, };
}
